{
  "skills": [
    {
      "name": "Machine Learning",
      "icon": "🤖",
      "color": "from-purple-500 to-pink-600",
      "summary": "Specialized in forecasting and predictive modeling with deep expertise in neural network architectures. Proven track record in competitions with top placements in national data science contests, focusing on time-series forecasting and multivariate analysis.",
      "sections": [
        {
          "title": "Time-Series Forecasting",
          "description": "Expert in building advanced forecasting models using NHITS, NBEATSx, LSTM, TiDE, and TSMixerx architectures. Successfully developed models to predict daily food prices across 34 Indonesian provinces with 13 commodities, achieving top performance in competitive environments."
        },
        {
          "title": "Hybrid Deep Learning",
          "description": "Developed innovative CNN-LSTM hybrid architectures for multivariate forecasting tasks. Specialized in combining convolutional layers for feature extraction with recurrent networks for sequential pattern recognition, particularly effective for food price index predictions."
        },
        {
          "title": "Neural Network Optimization",
          "description": "Proficient in hyperparameter optimization using Keras Tuner and advanced model architectures. Experience with CNN implementations on MNIST and Fashion-MNIST datasets, focusing on performance optimization and model efficiency."
        }
      ]
    },
    {
      "name": "Web Development",
      "icon": "🌐",
      "color": "from-blue-500 to-cyan-600",
      "summary": "Full-stack developer with modern JavaScript frameworks and responsive design principles. Specialized in creating dynamic, interactive web applications with emphasis on user experience and performance optimization.",
      "sections": [
        {
          "title": "React Development",
          "description": "Proficient in building dynamic single-page applications using React framework. Created interactive portfolio websites with modern component architecture, state management, and efficient rendering patterns for optimal user experience."
        },
        {
          "title": "Tailwind CSS",
          "description": "Expert in utility-first CSS framework for creating responsive, modern, and creative user interfaces. Skilled in implementing complex layouts, animations, and responsive designs that work seamlessly across all device sizes."
        },
        {
          "title": "Vite & Modern Tooling",
          "description": "Experienced with modern build tools and development environments. Utilizes Vite for fast development workflows, hot module replacement, and optimized production builds for enhanced development productivity."
        }
      ]
    },
    {
      "name": "Data Science",
      "icon": "📊",
      "color": "from-green-500 to-blue-600",
      "summary": "Comprehensive data science expertise spanning from data acquisition to advanced analytics. Strong research methodologies with practical experience in competitive data science environments and real-world forecasting applications.",
      "sections": [
        {
          "title": "Forecasting Specialist",
          "description": "Deep expertise in predictive modeling and time-series analysis. Specialized in economic forecasting, particularly in commodity price prediction with integration of exogenous features for enhanced model accuracy and reliability."
        },
        {
          "title": "Web Scraping & Data Acquisition",
          "description": "Skilled in automated data collection and web crawling techniques. Proficient in extracting structured data from various sources, handling different data formats, and building robust data pipelines for continuous data ingestion."
        },
        {
          "title": "Research Methodology",
          "description": "Strong foundation in research design, hypothesis testing, and statistical analysis. Experience in academic and competitive research environments with focus on reproducible results and methodological rigor."
        }
      ]
    },
    {
      "name": "Network Engineering",
      "icon": "🔗",
      "color": "from-orange-500 to-red-600",
      "summary": "Certified network professional with expertise in enterprise networking solutions. Specialized in MikroTik technologies with national-level competition experience and industry-recognized certifications.",
      "sections": [
        {
          "title": "MikroTik Certified Engineer (MTCRE)",
          "description": "Advanced certification in routing and network engineering. Capable of designing, implementing, and troubleshooting complex network infrastructures using MikroTik RouterOS and hardware solutions."
        },
        {
          "title": "Network Associate (MTCNA)",
          "description": "Foundational expertise in network administration and configuration. Proficient in basic to intermediate networking concepts, routing protocols, and network security implementations using MikroTik systems."
        },
        {
          "title": "Competition Experience",
          "description": "National finalist in Olimpiade Jaringan Mikrotik 2023, demonstrating practical networking skills under competitive conditions. Experience in network design challenges and real-world problem-solving scenarios."
        }
      ]
    },
    {
      "name": "Leadership & Communication",
      "icon": "👥",
      "color": "from-yellow-500 to-orange-600",
      "summary": "Strong interpersonal and leadership skills with experience in team management and public presentation. Capable of translating technical concepts into business value and leading cross-functional projects.",
      "sections": [
        {
          "title": "Team Leadership",
          "description": "Experienced in leading technical teams and collaborative projects. Skilled in coordinating diverse skill sets, managing project timelines, and ensuring effective communication across different stakeholders and technical domains."
        },
        {
          "title": "Public Speaking",
          "description": "Confident presenter capable of delivering technical content to diverse audiences. Experience in explaining complex data science concepts, presenting research findings, and communicating project results to both technical and non-technical stakeholders."
        },
        {
          "title": "Business Planning",
          "description": "Skilled in creating comprehensive business plans and pitch decks. Ability to bridge technical solutions with business requirements, identify market opportunities, and present compelling value propositions to stakeholders."
        }
      ]
    },
    {
      "name": "Emerging Technologies",
      "icon": "⚡",
      "color": "from-indigo-500 to-purple-600",
      "summary": "Continuously adapting to cutting-edge technologies with focus on AI engineering and prompt optimization. Stays current with latest developments in machine learning, natural language processing, and AI-assisted development workflows.",
      "sections": [
        {
          "title": "Prompt Engineering",
          "description": "Skilled in designing effective prompts for large language models and AI systems. Understanding of prompt optimization techniques, context management, and leveraging AI tools for enhanced productivity and problem-solving."
        },
        {
          "title": "AI Integration",
          "description": "Experience in integrating AI capabilities into existing workflows and applications. Focus on practical implementations of machine learning models in production environments and AI-assisted development processes."
        },
        {
          "title": "Technology Adaptation",
          "description": "Quick learner with demonstrated ability to master new technologies and frameworks. Maintains awareness of industry trends and emerging tools in data science, web development, and AI engineering domains."
        }
      ]
    }
  ]
}