{
  "skills": [
    {
      "name": "Programming",
      "icon": "💻",
      "color": "from-blue-500 to-purple-600",
      "summary": "As a skilled programmer with a focus on AI engineering and backend systems, I work fluently across multiple languages to build robust and intelligent solutions. My experience spans across scripting, backend development, and machine learning pipelines.",
      "sections": [
        {
          "title": "Python",
          "description": "Used extensively for machine learning, data preprocessing, and deep learning workflows. Proficient in handling time-series data, building LSTM-based imputation models, and managing structured datasets with libraries like pandas, NumPy, and TensorFlow."
        },
        {
          "title": "JavaScript",
          "description": "Applied mainly in web development, particularly in frontend interactions (React) and API communication. Strong understanding of asynchronous logic, DOM manipulation, and modern ECMAScript standards. Combined with TypeScript for type safety and scalability."
        },
        {
          "title": "Golang",
          "description": "Focused on high-performance backend services and concurrent systems. Used for developing fast, stateless APIs, microservices, and real-time data pipelines. Appreciated for its simplicity, performance, and strong typing in production environments."
        }
      ]
    },
    {
      "name": "Design",
      "icon": "🎨",
      "color": "from-pink-500 to-red-500",
      "summary": "Creating intuitive and visually appealing interfaces with a focus on user experience and modern design principles. My design approach combines aesthetic appeal with functional usability.",
      "sections": [
        {
          "title": "UI/UX Design",
          "description": "Designing user interfaces that prioritize usability and visual hierarchy. Experience with wireframing, prototyping, and creating design systems that scale across different platforms and devices."
        },
        {
          "title": "Frontend Development",
          "description": "Translating designs into responsive, interactive web applications using modern CSS frameworks like Tailwind CSS, along with component-based architectures in React for maintainable and scalable interfaces."
        },
        {
          "title": "Design Tools",
          "description": "Proficient in industry-standard design tools including Figma for collaborative design work, Adobe Creative Suite for graphic design, and various prototyping tools for user testing and validation."
        }
      ]
    },
    {
      "name": "Data Science",
      "icon": "📊",
      "color": "from-green-500 to-blue-600",
      "summary": "Comprehensive data science expertise spanning from data acquisition to advanced analytics. Strong research methodologies with practical experience in competitive data science environments and real-world forecasting applications.",
      "sections": [
        {
          "title": "Forecasting Specialist",
          "description": "Deep expertise in predictive modeling and time-series analysis. Specialized in economic forecasting, particularly in commodity price prediction with integration of exogenous features for enhanced model accuracy and reliability."
        },
        {
          "title": "Web Scraping & Data Acquisition",
          "description": "Skilled in automated data collection and web crawling techniques. Proficient in extracting structured data from various sources, handling different data formats, and building robust data pipelines for continuous data ingestion."
        },
        {
          "title": "Research Methodology",
          "description": "Strong foundation in research design, hypothesis testing, and statistical analysis. Experience in academic and competitive research environments with focus on reproducible results and methodological rigor."
        }
      ]
    },
    {
      "name": "Network Engineering",
      "icon": "🔗",
      "color": "from-orange-500 to-red-600",
      "summary": "Certified network professional with expertise in enterprise networking solutions. Specialized in MikroTik technologies with national-level competition experience and industry-recognized certifications.",
      "sections": [
        {
          "title": "MikroTik Certified Engineer (MTCRE)",
          "description": "Advanced certification in routing and network engineering. Capable of designing, implementing, and troubleshooting complex network infrastructures using MikroTik RouterOS and hardware solutions."
        },
        {
          "title": "Network Associate (MTCNA)",
          "description": "Foundational expertise in network administration and configuration. Proficient in basic to intermediate networking concepts, routing protocols, and network security implementations using MikroTik systems."
        },
        {
          "title": "Competition Experience",
          "description": "National finalist in Olimpiade Jaringan Mikrotik 2023, demonstrating practical networking skills under competitive conditions. Experience in network design challenges and real-world problem-solving scenarios."
        }
      ]
    },
    {
      "name": "Leadership & Communication",
      "icon": "👥",
      "color": "from-yellow-500 to-orange-600",
      "summary": "Strong interpersonal and leadership skills with experience in team management and public presentation. Capable of translating technical concepts into business value and leading cross-functional projects.",
      "sections": [
        {
          "title": "Team Leadership",
          "description": "Experienced in leading technical teams and collaborative projects. Skilled in coordinating diverse skill sets, managing project timelines, and ensuring effective communication across different stakeholders and technical domains."
        },
        {
          "title": "Public Speaking",
          "description": "Confident presenter capable of delivering technical content to diverse audiences. Experience in explaining complex data science concepts, presenting research findings, and communicating project results to both technical and non-technical stakeholders."
        },
        {
          "title": "Business Planning",
          "description": "Skilled in creating comprehensive business plans and pitch decks. Ability to bridge technical solutions with business requirements, identify market opportunities, and present compelling value propositions to stakeholders."
        }
      ]
    },
    {
      "name": "Emerging Technologies",
      "icon": "⚡",
      "color": "from-indigo-500 to-purple-600",
      "summary": "Continuously adapting to cutting-edge technologies with focus on AI engineering and prompt optimization. Stays current with latest developments in machine learning, natural language processing, and AI-assisted development workflows.",
      "sections": [
        {
          "title": "Prompt Engineering",
          "description": "Skilled in designing effective prompts for large language models and AI systems. Understanding of prompt optimization techniques, context management, and leveraging AI tools for enhanced productivity and problem-solving."
        },
        {
          "title": "AI Integration",
          "description": "Experience in integrating AI capabilities into existing workflows and applications. Focus on practical implementations of machine learning models in production environments and AI-assisted development processes."
        },
        {
          "title": "Technology Adaptation",
          "description": "Quick learner with demonstrated ability to master new technologies and frameworks. Maintains awareness of industry trends and emerging tools in data science, web development, and AI engineering domains."
        }
      ]
    }
  ]
}
